/*********************************************************************************************************
* 模块名称: CalcCompileTime.c
* 摘    要: 
* 当前版本: 1.0.0
* 作    者: 666immortal
* 完成日期: 
* 内    容:
* 注    意: none                                                                 
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/


/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "CalcCompileTime.h"
#include "UART.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
//声明枚举结构体，便于分辨数组元素的含义，例如s_arrCompileTime[COMPILE_TIME_MAX]，实际表示s_arrCompileTime[6]
typedef enum
{
  COMPILE_TIME_SEC,        //COMPILE_TIME_SEC为整型0
  COMPILE_TIME_MIN,        //COMPILE_TIME_MIN为整型1
  COMPILE_TIME_HOUR,       //COMPILE_TIME_HOUR为整型2
  COMPILE_TIME_DAY,        //COMPILE_TIME_DAY为整型3
  COMPILE_TIME_MONTH,      //COMPILE_TIME_MONTH为整型4
  COMPILE_TIME_YEAR,       //COMPILE_TIME_YEAR为整型5
  COMPILE_TIME_MAX         //COMPILE_TIME_MAX为整型6
}EnumCompileTime;

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
//__DATE__和__TIME__不是关键字，而是两个编译器宏定义，当编译到的时候，自动将系统时间插入程序中
static  char* s_pCompiledDate = __DATE__;     //__DATE__实际上是指向系统当前日期的指针，例如：Mar 01 2018
static  char* s_pCompiledTime = __TIME__;     //__TIME__实际上是指向系统当前时间的指针，例如：20:11:19

//定义一个字符二维数组用来存放十二个月份的缩写
static  char  s_arrMonthTab[12][3]={ "Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"};

//定义一个u16类型一维数组用来存储编译的日期和时间
static  u16   s_arrCompileTime[COMPILE_TIME_MAX];   

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  u8    CmpStr(u8* s1, u8* s2, u8 len);      //比较字符串，由CalcCompiledTime()函数调用  
static  void  CalcCompiledTime(void);              //计算编译时间

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称: CmpStr
* 函数功能: 比较字符串，由CalcCompiledTime()函数调用  
* 输入参数: 字符串s1和字符串s2，字符串长度
* 输出参数: void
* 返 回 值: 如果字符串相同，返回值为1，如果字符串不同，返回值则为0
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
static  u8  CmpStr(u8* s1, u8* s2, u8 len)
{
  u8 i;
  
  for(i = 0; i < len; i++)        //循环进行len次
  {
    if(*s1++ != *s2++)            //逐个比较字符串的字符  
    {
      return 0;                   //如果两个字符串不相同，返回0
    } 
  }
  
  return 1;                       //如果两个字符串完全相同，返回1
}

/*********************************************************************************************************
* 函数名称: CalcCompiledTime
* 函数功能: 计算编译时间  
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: //__DATE__实际上是指向系统当前日期的指针，例如：Mar 01 2018
            //__TIME__实际上是指向系统当前时间的指针，例如：20:11:19
            //                M a r  0 1  2 0 1 8
            //s_pCompiledDate[0 1 2  3 4  5 6 7 8],数组与日期的对应关系
            //                2 0 : 1 1 : 1 9
            //s_pCompiledTime[0 1 2 3 4 5 6 7],数组与时间的对应关系 
*********************************************************************************************************/
static  void CalcCompiledTime(void)
{
  u8  arrMonChar[3];                                  //用于存放当前月份的3个缩写字符
  u8  i;
  
  for(i = 0; i < 3; i++)                              //取出当前月份3个缩写字符
  {
    arrMonChar[i] = s_pCompiledDate[i];               //将__DATE__的前3个字符赋给arrMonChar数组
  }
    
  for(i = 0; i < 12; i++)                             //12个月份，因此最多比较12次
  {
    if(CmpStr((u8*)s_arrMonthTab[i], arrMonChar, 3))  //调用CmpStr进行月份缩写比较匹配
    {
      break;                                          //若匹配则跳出循环，此时i循环到实际月份减1
    }	     
  }
   
  s_arrCompileTime[COMPILE_TIME_MONTH] = i + 1;       //i+1即为实际的月份
  
  //[4]为日期的高位，即day的十位，如果日期高位为空字符，即day在0-9之间
  if(s_pCompiledDate[4] == ' ')                       
  {
    //日期直接减去"0"的ASCII码，即为day的绝对值，0-9之间
    s_arrCompileTime[COMPILE_TIME_DAY] = s_pCompiledDate[5] - '0';     
  }
  else
  {
    //否则，day为两位数，即在10-31之间
    s_arrCompileTime[COMPILE_TIME_DAY] = 10 * (s_pCompiledDate[4] - '0') + s_pCompiledDate[5] - '0';
  }
  //每个位的数乘以相应的位之和即为年份
  s_arrCompileTime[COMPILE_TIME_YEAR]  = 1000 * (s_pCompiledDate[7]  - '0') + 
                                          100 * (s_pCompiledDate[8]  - '0') + 
                                           10 * (s_pCompiledDate[9]  - '0') +
                                                (s_pCompiledDate[10] - '0');
   
  //每个位的数乘以相应的位之和即为时间  
  s_arrCompileTime[COMPILE_TIME_HOUR]  =  10 * (s_pCompiledTime[0]  - '0') + s_pCompiledTime[1] - '0';  
  s_arrCompileTime[COMPILE_TIME_MIN]   =  10 * (s_pCompiledTime[3]  - '0') + s_pCompiledTime[4] - '0';  
  s_arrCompileTime[COMPILE_TIME_SEC]   =  10 * (s_pCompiledTime[6]  - '0') + s_pCompiledTime[7] - '0'; 
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitCalcCompileTime
* 函数功能: 初始化并计算编译时间
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
void InitCalcCompileTime(void)
{
  i16 i;                                   //用于循环语句

  for(i = 0; i < COMPILE_TIME_MAX; i++)    //给存储编译时间的数组赋初值
  {
    s_arrCompileTime[i] = 0;               //数组元素初始值均为0
  }
    
  CalcCompiledTime();                      //计算编译时间
}

/*********************************************************************************************************
* 函数名称: GetCompileTime
* 函数功能: 获取编译时间
* 输入参数: void
* 输出参数: void
* 返 回 值: s_arrCompileTime
* 创建日期: 2016年04月10日
* 注    意: 
*********************************************************************************************************/
u16* GetCompileTime(void)
{
  return(s_arrCompileTime);                //返回计算出的编译时间
}

/*********************************************************************************************************
* 函数名称: PrintCompileTime
* 函数功能: 打印编译时间
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
void  PrintCompileTime(void)
{ 
  //打印编译时间，格式为：年-月-日 小时：分钟：秒
  printf("Compiled time: %04d-%02d-%02d %02d:%02d:%02d\r\n", 
        s_arrCompileTime[COMPILE_TIME_YEAR], 
        s_arrCompileTime[COMPILE_TIME_MONTH], 
        s_arrCompileTime[COMPILE_TIME_DAY],
        s_arrCompileTime[COMPILE_TIME_HOUR], 
        s_arrCompileTime[COMPILE_TIME_MIN], 
        s_arrCompileTime[COMPILE_TIME_SEC]);
}
