/*********************************************************************************************************
* 模块名称: MeasureMCUTemp.c
* 摘    要: 
* 当前版本: 1.0.0
* 作    者: 
* 完成日期: 2018年03月01日
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "MeasureMCUTemp.h"
#include "stm32f10x_conf.h"
#include "Systick.h"
		   
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitADC
* 函数功能: 初始化ADC
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 这里我们仅以规则通道为例 
            我们默认将开启通道0~3
*********************************************************************************************************/	
void InitADC(void)
{
	ADC_InitTypeDef ADC_InitStructure;                       //定义结构体ADC_InitStructure，用来配置ADC
  
  RCC_APB2PeriphClockCmd(USER_DEFINE_ADC_CLK, ENABLE);     //使能ADC通道时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA , ENABLE );	 //使能GPIO的时钟
 
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);                        //设置分频因子为6，时钟为72M/6=12MHz

  ADC_DeInit(USER_DEFINE_ADC);                             //将外设ADC的全部寄存器重设为缺省值（默认值）
 
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;	     //ADC工作在独立模式
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;	           //模数转换工作在单通道模式
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;    	 //模数转换工作在单次转换模式
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;	//转换由软件而不是外部触发启动
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;	 //ADC数据右对齐
	ADC_InitStructure.ADC_NbrOfChannel = 1;	                 //顺序进行规则转换的ADC通道的数目
	ADC_Init(USER_DEFINE_ADC, &ADC_InitStructure);	         //根据ADC_InitStruct中指定的参数初始化外设ADC的寄存器

	ADC_TempSensorVrefintCmd(ENABLE);                        //开启内部温度传感器
 
	ADC_Cmd(USER_DEFINE_ADC, ENABLE);	                       //使能指定的ADC

	ADC_ResetCalibration(USER_DEFINE_ADC);	                 //重置指定的ADC的复位寄存器

  while(ADC_GetResetCalibrationStatus(USER_DEFINE_ADC));   //获取ADC重置校准寄存器的状态,设置状态为等待

	ADC_StartCalibration(USER_DEFINE_ADC);	                 //开始指定ADC的校准

	while(ADC_GetCalibrationStatus(USER_DEFINE_ADC));		     //获取指定ADC的校准程序,设置状态则等待
}

/*********************************************************************************************************
* 函数名称: GetADC
* 函数功能: 获得ADC的采样数据
* 输入参数: ch：ADC指定通道
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意:
*********************************************************************************************************/
u16 GetADC(u8 ch)   
{
  //设置ADC,ADC通道,通道转换顺序为1,采样时间为239.5周期	  
	ADC_RegularChannelConfig(USER_DEFINE_ADC, ch, 1, ADC_SampleTime_239Cycles5 ); 			    
 
	ADC_SoftwareStartConvCmd(USER_DEFINE_ADC, ENABLE);		             //使能指定的ADC的软件转换启动功能
             
	while(!ADC_GetFlagStatus(USER_DEFINE_ADC, ADC_FLAG_EOC ));         //等待转换结束
             
	return ADC_GetConversionValue(USER_DEFINE_ADC);	                   //返回最近一次ADC规则组的转换结果
}

  /*********************************************************************************************************
* 函数名称: GetADCAverage
* 函数功能: 获取通道ch的ADC采样数据，取times次,然后返回平均值
* 输入参数: ch:ADC指定通道； times:ADC采样次数
* 输出参数: void
* 返 回 值: ADC采样数据的平均值
* 创建日期: 2018年03月01日
* 注    意:
*********************************************************************************************************/
u16 GetADCAverage(u8 ch,u8 times)
{
	u32 temp_val = 0;                //采样数据的加和
	u8 t;                            //定义一个变量执行循环语句
  
	for(t = 0; t < times; t++)       //循环加和
	{
		temp_val += GetADC(ch);        //采样数据的加和
    
		DelayNms(5);                   //延时5ms
	}
	return temp_val / times;         //返回采样数据的平均值
} 	   

/*********************************************************************************************************
* 函数名称: GetTemp
* 函数功能: 获取内部温度传感器温度值
* 输入参数: void
* 输出参数: void
* 返 回 值: 返回值:温度值
* 创建日期: 2018年03月01日
* 注    意: 由于温度和芯片输出电压成一定的比例关系
            因此我们可以先利用ADC求电压，再转化为温度
*********************************************************************************************************/
float GetTemp(void)
{
	u32         adcx;                                //定义一个变量存储采样数据
	float     result;                                //函数返回值
 	double temperate;                                //所求温度值
  
	adcx = GetADCAverage(ADC_Channel_16, 20);	       //读取通道16,采样20次取平均值
  
	temperate = (float)adcx * (3.3 / 4096);		       //求内部的电压值 
  
	temperate = (1.43 - temperate) / 0.0043 + 25;    //转换为温度值 	 
  
	result = temperate;					                     //将温度值赋值给返回值
  
	return result;                                   //返回温度值
}
