/*********************************************************************************************************
* 模块名称: Capture.h
* 摘    要: Capture驱动
* 当前版本: 1.0.0
* 作    者: 
* 完成日期: 2018年03月01日 
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/
#ifndef _CAPTURE_H_
#define _CAPTURE_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define USER_DEFINE_CAPTURE_GPIO_PORT         GPIOA                 //用户定义捕获的GPIO端口
#define USER_DEFINE_CAPTURE_GPIO_PIN          GPIO_Pin_0            //用户定义捕获的引脚
#define USER_DEFINE_CAPTURE_GPIO_CLK          RCC_APB2Periph_GPIOA  //用户定义捕获的时钟

#define USER_DEFINE_CAPTURE_TIM               TIM5                  //用户定义捕获的定时器TIMx
#define USER_DEFINE_CAPTURE_TIM_CLK           RCC_APB1Periph_TIM5   //用户定义捕获的定时器TIMx的时钟
#define USER_DEFINE_CAPTURE_CHANNEL           TIM_Channel_1         //用户定义捕获的通道

#define USER_DEFINE_CAPTURE_TIM_IRQn          TIM5_IRQn             //用户定义捕获的定时器TIMx的中断通道
#define USER_DEFINE_CAPTURE_TIM_IRQHandler    TIM5_IRQHandler       //用户定义捕获的定时器TIMx的中断服务函数

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitCapture(void);              //初始化Capture
u8    GetCaptureVal(i32* pCapVal);    //获取捕获时间，返回值为1表示捕获成功，此时*pCapVal才有意义
 
#endif
