/*********************************************************************************************************
* 模块名称: WWDG.c
* 摘    要: 
* 当前版本: 1.0.0
* 作    者: 
* 完成日期: 2018年03月01日
* 内    容: 
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "WWDG.h"
#include <stm32f10x_conf.h>
#include "stm32f10x_wwdg.h"
#include "UART.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void ConfigWWDG(u8 tr, u8 wr, u32 fprer);    //配置窗口看门狗

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: ConfigWWDG
* 函数功能: 配置窗口看门狗 
* 输入参数: tr（WWDG计数器的起始值）：T[6:0]，计数器值；wr（WWDG计数器的上窗口值）：W[6:0]，窗口值；
           fprer：分频系数（WDGTB）,仅最低2位有效
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 建议tr为0x7F，即最大值，以免上机即被复位
*           Fwwdg = PCLK1/(4096*2^fprer) = 36KHz / (4096*2^fprer)
*********************************************************************************************************/
static  void ConfigWWDG(u8 tr, u8 wr, u32 fprer) 
{
  NVIC_InitTypeDef NVIC_InitStructure;                  //定义结构体NVIC_InitStructure，用来配置NVIC参数

  RCC_APB1PeriphClockCmd(RCC_APB1Periph_WWDG, ENABLE);  //使能WWDG时钟
 
  WWDG_SetPrescaler(fprer);                             //设置IWDG预分频值
                                                        
  WWDG_SetWindowValue(wr);                              //设置窗口值
                                                        
  WWDG_Enable(tr & 0x7F);                               //使能看门狗，设置计数器              
                                                        
  WWDG_ClearFlag();                                     //清除提前唤醒中断标志位 

  //初始化窗口看门狗NVIC
  NVIC_InitStructure.NVIC_IRQChannel                     = WWDG_IRQn; //WWDG中断
  //NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;         //抢占优先级为2 
  //NVIC_InitStructure.NVIC_IRQChannelSubPriority        = 3;         //子优先级为3
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;                     //使能中断NVIC的中断通道
  NVIC_Init(&NVIC_InitStructure);                                     //根据参数初始化NVIC

  WWDG_EnableIT();                                                    //使能窗口看门狗中断
}

/*********************************************************************************************************
* 函数名称WWDG_IRQHandler
* 函数功能: 窗口看门狗中断服务程序 
* 输入参数: viud
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 当递减计数器到达0x40时，产生中断，如果中断中没有更新计数器的值，则在计数器从0x40翻转到0x3F时，
*           产生一个复位。
*********************************************************************************************************/
void WWDG_IRQHandler(void)
{
  SetWWDGCounter(USER_DEFINE_WWDG_TR);    //重新设置窗口看门狗的值，恢复到WWDG_TR

  WWDG_ClearFlag();                       //清除提前唤醒中断标志位
  
  //LED0进行翻转，则LED0闪烁
  GPIO_WriteBit(GPIOB, GPIO_Pin_5, (BitAction)(1 - GPIO_ReadOutputDataBit(GPIOB, GPIO_Pin_5)));
}

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitWWDG
* 函数功能: 初始化窗口看门狗 
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 中断间隔时间计算(分频数为8时)
*           Fwwdg = PCLK1 / (4096*2^fprer) = 36KHz / (4096*2^fprer) 
*                 = 36MHz / (4096*2^3) = 36KHz / 32768 = 1098.6KHz(0.91ms)
*           中断间隔时间 = Fwwdg * (TR - 0x3F) = 0.91ms * (0x7F - 0x3F) = 0.91 * 64 = 58.24ms 
*           中断间隔时间 = Fwwdg * (TR - 0x3F) = 0.91ms * (0x5F - 0x3F) = 0.91 * 32 = 29.12ms
*********************************************************************************************************/
void InitWWDG(void)
{   
  ConfigWWDG(0X7F, USER_DEFINE_WWDG_WR, USER_DEFINE_WWDG_FPRER);  //配置窗口看门狗 
}

/*********************************************************************************************************
* 函数名称: SetWWDGCounter
* 函数功能: 设置WWDG计数器的值 
* 输入参数: cnt：WWDG计数器的初始值
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
void SetWWDGCounter(u8 cnt)
{   
  WWDG_Enable(cnt);  //使能看门狗，设置计数器  
}
