/*********************************************************************************************************
* 模块名称: DAC.c
* 摘    要: 
* 当前版本: 1.0.0
* 作    者: 666immortal
* 完成日期: 2018年03月01日
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DAC.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/


/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/


/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/


/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitDAC
* 函数功能: 初始化DAC通道1输出
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
void InitDAC(void)
{ 
  DAC_InitTypeDef  DAC_InitStructure;     //定义结构体DAC_InitStructure，用来配置DAC  
	GPIO_InitTypeDef GPIO_InitStructure;    //定义结构体GPIO_InitStructure，用来配置DAC通道的GPIO
	
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE );	        //使能DAC的时钟
	RCC_APB2PeriphClockCmd(USER_DEFINE_DAC_GPIO_CLK, ENABLE );    //使能DAC通道的GPIO端口时钟
   
	GPIO_InitStructure.GPIO_Pin = USER_DEFINE_DAC_GPIO_PIN;				//设置GPIO的引脚
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN; 		            //模拟输入模式
 	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;             //设置I/O口速率50MHz
 	GPIO_Init(USER_DEFINE_DAC_GPIO, &GPIO_InitStructure);         //根据参数初始化GPIO
  
	GPIO_SetBits(USER_DEFINE_DAC_GPIO, USER_DEFINE_DAC_GPIO_PIN); //设置指定的数据端口位
					
	DAC_InitStructure.DAC_Trigger = DAC_Trigger_None;	                        //设置不使用触发功能
	DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;           //设置不使用波形发生
	DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bit0; //屏蔽、幅值设置
	DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Disable ;	          //DAC输出缓存关闭 BOFF1=1
  DAC_Init(USER_DEFINE_DAC_CHANNEL, &DAC_InitStructure);	                  //初始化DAC通道

	DAC_Cmd(USER_DEFINE_DAC_CHANNEL, ENABLE);            //使能DAC
  
  if(USER_DEFINE_DAC_CHANNEL == DAC_Channel_1)         //设置通道1
  {
    DAC_SetChannel1Data(DAC_Align_12b_R, 0);           //设置DAC通道1的值，且采用12位右对齐数据格式
  }
  else if(USER_DEFINE_DAC_CHANNEL == DAC_Channel_2)    //设置通道2
  {
    DAC_SetChannel2Data(DAC_Align_12b_R, 0);           //设置DAC通道2的值，且采用12位右对齐数据格式
  }   
}

/*********************************************************************************************************
* 函数名称: SetDACVol
* 函数功能: 设置DAC通道输出电压
* 输入参数: volnum:0-3300,代表0-3.3V
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年03月01日
* 注    意: 
*********************************************************************************************************/
void SetDACVol(u16 volnum)
{
	float temp = volnum;                               //将输入参数赋值给temp
  
	temp /= 1000;                                      //temp值为设置的电压值
  
	temp = temp * 4096 / 3.3;                          //通过公式计算DOR寄存器的值
  
  if(USER_DEFINE_DAC_CHANNEL == DAC_Channel_1)       //设置通道1
  {
    DAC_SetChannel1Data(DAC_Align_12b_R, temp);      //设置DAC通道1的值，且采用12位右对齐数据格式
  }
  else if(USER_DEFINE_DAC_CHANNEL == DAC_Channel_2)  //设置通道2
  {
    DAC_SetChannel2Data(DAC_Align_12b_R, temp);      //设置DAC通道2的值，且采用12位右对齐数据格式
  }
}
